Task 1
Создать класс, который в цикле выводит на экран числа от 0-20 и в каждой итерации цикла засыпает на 1 секунду,
запустить его в отдельном потоке. Поток main должен дождаться окончания работы дочернего потока
и затем вывести на экран сообщение о том, что главный поток завершен

Task 2
Есть магазин игрушек, в который несколько поставщиков (потоков) доставляют товар. Вам необходимо доставить в магазин игрушки
(например 100 от одного поставщика и 50 от другого и затем вывести на экран все игрушки, которые сейчас в магазине

Task 3
Есть коллекция студентов. У каждого студента есть список любимых книг (книга - это отдельный класс с полями "название" и "год".
Написать программу которая бы выводила на экран топ-3 самых популярных книг среди студентов

Task 4
Написать программу, которая получает аргументом программы пути к файлам.
Программа должна посчитать кол-во слов в каждом файле по отдельности,
затем общее кол-во файлов и вывести на экран.
На каждый файл используйте отдельный поток для вычислений.

Task 5
Нужно поправить ошибки в коде, чтобы метод мейн нормально запустился.
Перед тем, как копировать этот код, создайте сами класс CodeRefactor, затем скопируйте в него метод main
Затем класс Website и enum.
Копируйте аккуратно и не внутрь класса CodeRefactor, а рядом с ним.


public class CodeRefactor {
    public static void main(String[] args) {
        Website website = new WebSite("http://www.onliner.by");

        String url = Website.getUrl();
        WebsiteType type = website.getType();

        System.out.println(url);
        System.out.println(type);
    }
}

class Website {
    private String url;
    private WebsiteType type;

    public Website(String ur1) {
        super(url, WebsiteType.NEWS);
    }

    public static Website(String url, WebsiteType type) {
        this.url = url;
        this.type = type;
    }

    public String getUrl() {
        return url;
    }

    public WebsiteType getType() {
        return type;
    }
}

enum WebsiteType {
    NEWS,
    MUSIC,
    EDUCATION
}
